const userAgreementtext = `
欢迎使用 [进度咻咻]（以下简称“本小程序”）。在您使用本小程序之前，请仔细阅读以下用户协议条款。本协议是您（以下简称“用户”）与本小程序运营方（以下简称“运营方”）之间具有法律约束力的协议。
第一条 接受条款

    用户在使用本小程序前，应当仔细阅读并完全同意本协议的所有内容。
    如果用户不同意本协议的任何条款，请勿使用本小程序。一旦用户开始使用本小程序，即视为用户已完全接受本协议。

第二条 用户注册与信息

    用户需通过微信授权登录使用本小程序。用户同意运营方根据隐私政策收集并使用其公开信息。
    用户应保证提供的信息真实、准确、完整，并自行承担因信息错误或不实导致的后果。

第三条 服务内容

    本小程序为用户提供项目管理、进度查看等相关服务。
    本小程序根据用户权限对数据进行分类管理。仅项目相关人员可以查看与其职责相关的内容。

第四条 用户行为规范

    用户在使用本小程序时不得从事以下行为：
        违反国家法律法规及相关政策的行为；
        侵犯他人合法权益的行为；
        发布虚假、不实或误导性信息；
        未经授权获取、使用或修改其他用户数据。
    用户承诺不对本小程序的服务进行反向工程、反编译或试图获取源代码。

第五条 隐私政策

    本小程序严格遵守相关法律法规，保障用户个人信息安全。
    用户的个人信息（如姓名、头像、联系方式等）仅用于提供小程序服务，不会在未经用户授权的情况下泄露给第三方。

第六条 服务变更与中止

    本小程序有权根据实际情况随时调整、暂停或终止服务，但应提前通知用户。
    因不可抗力或其他无法控制的原因导致服务中断或数据损失，运营方不承担责任，但将尽力减少可能对用户造成的影响。

第七条 知识产权

    本小程序的所有内容，包括但不限于代码、页面设计、图标和商标，均受法律保护，未经许可不得使用。
    用户在本小程序内上传的内容，其版权归用户所有，但用户授权运营方为提供服务之目的使用。

第八条 争议解决

    用户与运营方在本协议履行过程中发生的争议，应本着友好协商的原则解决。
    若协商未果，双方同意将争议提交至运营方所在地有管辖权的人民法院处理。

第九条 条款更新

    本协议可由运营方根据法律法规及业务需要随时修改，修改后的内容将通过小程序发布并及时通知用户。
    用户继续使用本小程序即视为同意接受修订后的条款。

`

module.exports = {
  userAgreementtext,
};
